app/views/dashboards/index.html.erb

<%= form_tag search_dashboards_path, :method => :get do %>
  <%= select_tag :location, options_for_select([["Location",""]]+Lawyer.select("DISTINCT city").all.map{|a| a.city}) %>
---
SELECT DISTINCT city FROM `lawyers`