app/views/dashboards/search.html.erb

      <td><%= lawyer.city %></td>
      <td><%= LawyerService.where("lawyer_code = '#{lawyer.lawyer_code}'").count %> </td>
---
SELECT COUNT(*) FROM `lawyer_services`  WHERE `lawyer_services`.`lawyer_code` = 636
SELECT `lawyers`.* FROM `lawyers`  WHERE (city = ' Chennai')