app/controllers/dashboards_controller.rb

SELECT `lawyers`.* FROM `lawyers`  WHERE (city = ' Chennai')  ORDER BY `lawyers`.`lawyer_name` ASC
---
  def search
    @lawyers = Lawyer.where("city = '#{params[:location]}'").order(:lawyer_name)