app/controllers/dashboards_controller.rb

  def show
    @lawyer = Lawyer.find(params[:id])
    @services = LawyerService.where("lawyer_code = '#{@lawyer.lawyer_code}'")
---
SELECT  `lawyers`.* FROM `lawyers`  WHERE `lawyers`.`id` = 561 LIMIT 1
SELECT `lawyer_services`.* FROM `lawyer_services`  WHERE `lawyer_services`.`lawyer_code` = 561

  def search
    @lawyers = Lawyer.where("city = '#{params[:location]}'")
---
SELECT `lawyers`.* FROM `lawyers`  WHERE (city = ' Chennai')

  def upload_lawyer
    if request.post?
      CSV.parse(params[:file].read, :headers => true) do |row|
        #row = row[0].to_s.split("\t").collect(&:strip)
        Lawyer.create({
            lawyer_name: row[1],
            lawyer_code: row[0],
            city: row[3],
            rating: row[4],
            years_of_experiance: row[2],
          })
---
INSERT INTO `lawyers` (`city`, `created_at`, `lawyer_code`, `lawyer_name`, `rating`, `updated_at`, `years_of_experiance`) VALUES (' city', '2014-12-20 14:21:26', '﻿lawyer_code', ' laywer_name', 0, '2014-12-20 14:21:26', 0)

  def upload_service
    if request.post?
      CSV.parse(params[:file].read, :headers => true) do |row|
        #row = row[0].to_s.split("\t").collect(&:strip)
        LawyerService.create({
            service_name: row[2],
            lawyer_code: row[0],
            service_code: row[1],
            price: row[3]
          })
---
INSERT INTO `lawyer_services` (`created_at`, `lawyer_code`, `price`, `service_code`, `service_name`, `updated_at`) VALUES ('2014-12-20 14:27:29', 'L111', 15000, 'S3', ' Divorce', '2014-12-20 14:27:29')
INSERT INTO `lawyers` (`city`, `created_at`, `lawyer_code`, `lawyer_name`, `updated_at`, `years_of_experiance`) VALUES ('15000', '2014-12-20 14:25:21', 'L111', 'S3', '2014-12-20 14:25:21', 0)